#include <string>
#include <iostream>
using namespace std;
/*
 Даны два числа a и b. Найти их среднее арифметическое.
 */
int main() {
    float a;
    float b;
    cout<<"Введите два числа : "<<endl;
    cin>>a>>b;
    float average = (a+b)/2;
    cout<<"Среднее арифметическое этих двух чисел : "<<average<<endl;
    return 0;
}




